/* automatically generated by rust-bindgen 0.69.5 */

pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C2X_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;

pub const CLOCK_REALTIME_COARSE: u32 = 5;
pub const CLOCK_MONOTONIC_COARSE: u32 = 6;
pub const CLOCK_BOOTTIME: u32 = 7;
pub const CLOCK_REALTIME_ALARM: u32 = 8;
pub const CLOCK_BOOTTIME_ALARM: u32 = 9;
pub const CLOCK_TAI: u32 = 11;
pub const TIMER_ABSTIME: u32 = 1;
pub const __clock_t_defined: u32 = 1;
pub const __time_t_defined: u32 = 1;
pub const __struct_tm_defined: u32 = 1;
pub const _STRUCT_TIMESPEC: u32 = 1;
pub const _BITS_ENDIAN_H: u32 = 1;
pub const __LITTLE_ENDIAN: u32 = 1234;
pub const __BIG_ENDIAN: u32 = 4321;
pub const __PDP_ENDIAN: u32 = 3412;
pub const _BITS_ENDIANNESS_H: u32 = 1;
pub const __BYTE_ORDER: u32 = 1234;
pub const __FLOAT_WORD_ORDER: u32 = 1234;
pub const __clockid_t_defined: u32 = 1;
pub const __timer_t_defined: u32 = 1;
pub const __itimerspec_defined: u32 = 1;
pub const _BITS_TYPES_LOCALE_T_H: u32 = 1;
pub const _BITS_TYPES___LOCALE_T_H: u32 = 1;
pub const TIME_UTC: u32 = 1;
pub const WASMEDGE_VERSION: &[u8; 7] = b"0.16.1\0";
pub const WASMEDGE_VERSION_MAJOR: u32 = 0;
pub const WASMEDGE_VERSION_MINOR: u32 = 16;
pub const WASMEDGE_VERSION_PATCH: u32 = 1;
pub const WasmEdge_Plugin_CurrentAPIVersion: u32 = 4;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tm {
    pub tm_sec: ::std::os::raw::c_int,
    pub tm_min: ::std::os::raw::c_int,
    pub tm_hour: ::std::os::raw::c_int,
    pub tm_mday: ::std::os::raw::c_int,
    pub tm_mon: ::std::os::raw::c_int,
    pub tm_year: ::std::os::raw::c_int,
    pub tm_wday: ::std::os::raw::c_int,
    pub tm_yday: ::std::os::raw::c_int,
    pub tm_isdst: ::std::os::raw::c_int,
    pub tm_gmtoff: ::std::os::raw::c_long,
    pub tm_zone: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_tm() {
    const UNINIT: ::std::mem::MaybeUninit<tm> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<tm>(),
        56usize,
        concat!("Size of: ", stringify!(tm))
    );
    assert_eq!(
        ::std::mem::align_of::<tm>(),
        8usize,
        concat!("Alignment of ", stringify!(tm))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_hour) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_hour)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mday) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_mon) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_mon)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_year) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_year)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_wday) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_wday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_yday) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_yday)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_isdst) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_isdst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_gmtoff) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_gmtoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tm_zone) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(tm),
            "::",
            stringify!(tm_zone)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        16usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        8usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct itimerspec {
    pub it_interval: timespec,
    pub it_value: timespec,
}
#[test]
fn bindgen_test_layout_itimerspec() {
    const UNINIT: ::std::mem::MaybeUninit<itimerspec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<itimerspec>(),
        32usize,
        concat!("Size of: ", stringify!(itimerspec))
    );
    assert_eq!(
        ::std::mem::align_of::<itimerspec>(),
        8usize,
        concat!("Alignment of ", stringify!(itimerspec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).it_value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(itimerspec),
            "::",
            stringify!(it_value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sigevent {
    _unused: [u8; 0],
}
pub type pid_t = __pid_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        232usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn clock() -> clock_t;
}
extern "C" {
    pub fn time(__timer: *mut time_t) -> time_t;
}
extern "C" {
    pub fn difftime(__time1: time_t, __time0: time_t) -> f64;
}
extern "C" {
    pub fn mktime(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn strftime(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
    ) -> usize;
}
extern "C" {
    pub fn strftime_l(
        __s: *mut ::std::os::raw::c_char,
        __maxsize: usize,
        __format: *const ::std::os::raw::c_char,
        __tp: *const tm,
        __loc: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn gmtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn localtime(__timer: *const time_t) -> *mut tm;
}
extern "C" {
    pub fn gmtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn localtime_r(__timer: *const time_t, __tp: *mut tm) -> *mut tm;
}
extern "C" {
    pub fn asctime(__tp: *const tm) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime(__timer: *const time_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn asctime_r(
        __tp: *const tm,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ctime_r(
        __timer: *const time_t,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub static mut __tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub static mut __daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut __timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub static mut tzname: [*mut ::std::os::raw::c_char; 2usize];
}
extern "C" {
    pub fn tzset();
}
extern "C" {
    pub static mut daylight: ::std::os::raw::c_int;
}
extern "C" {
    pub static mut timezone: ::std::os::raw::c_long;
}
extern "C" {
    pub fn timegm(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn timelocal(__tp: *mut tm) -> time_t;
}
extern "C" {
    pub fn dysize(__year: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nanosleep(
        __requested_time: *const timespec,
        __remaining: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getres(__clock_id: clockid_t, __res: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_gettime(__clock_id: clockid_t, __tp: *mut timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_settime(__clock_id: clockid_t, __tp: *const timespec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_nanosleep(
        __clock_id: clockid_t,
        __flags: ::std::os::raw::c_int,
        __req: *const timespec,
        __rem: *mut timespec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clock_getcpuclockid(__pid: pid_t, __clock_id: *mut clockid_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_create(
        __clock_id: clockid_t,
        __evp: *mut sigevent,
        __timerid: *mut timer_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_delete(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_settime(
        __timerid: timer_t,
        __flags: ::std::os::raw::c_int,
        __value: *const itimerspec,
        __ovalue: *mut itimerspec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_gettime(__timerid: timer_t, __value: *mut itimerspec) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timer_getoverrun(__timerid: timer_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn timespec_get(
        __ts: *mut timespec,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ConfigureContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_StatisticsContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ASTModuleContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_FunctionTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_MemoryTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_TableTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_TagTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_GlobalTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ImportTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ExportTypeContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_CompilerContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_LoaderContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ValidatorContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ExecutorContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_StoreContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ModuleInstanceContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_FunctionInstanceContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_TableInstanceContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_MemoryInstanceContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_TagInstanceContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_GlobalInstanceContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_CallingFrameContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_Async {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_VMContext {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_PluginContext {
    _unused: [u8; 0],
}
pub const WasmEdge_Standard_WASM_1: WasmEdge_Standard = 0;
pub const WasmEdge_Standard_WASM_2: WasmEdge_Standard = 1;
pub const WasmEdge_Standard_WASM_3: WasmEdge_Standard = 2;
pub type WasmEdge_Standard = ::std::os::raw::c_uint;
pub const WasmEdge_Proposal_ImportExportMutGlobals: WasmEdge_Proposal = 0;
pub const WasmEdge_Proposal_NonTrapFloatToIntConversions: WasmEdge_Proposal = 1;
pub const WasmEdge_Proposal_SignExtensionOperators: WasmEdge_Proposal = 2;
pub const WasmEdge_Proposal_MultiValue: WasmEdge_Proposal = 3;
pub const WasmEdge_Proposal_BulkMemoryOperations: WasmEdge_Proposal = 4;
pub const WasmEdge_Proposal_ReferenceTypes: WasmEdge_Proposal = 5;
pub const WasmEdge_Proposal_SIMD: WasmEdge_Proposal = 6;
pub const WasmEdge_Proposal_TailCall: WasmEdge_Proposal = 7;
pub const WasmEdge_Proposal_ExtendedConst: WasmEdge_Proposal = 8;
pub const WasmEdge_Proposal_FunctionReferences: WasmEdge_Proposal = 9;
pub const WasmEdge_Proposal_GC: WasmEdge_Proposal = 10;
pub const WasmEdge_Proposal_MultiMemories: WasmEdge_Proposal = 11;
pub const WasmEdge_Proposal_RelaxSIMD: WasmEdge_Proposal = 12;
pub const WasmEdge_Proposal_Annotations: WasmEdge_Proposal = 13;
pub const WasmEdge_Proposal_ExceptionHandling: WasmEdge_Proposal = 14;
pub const WasmEdge_Proposal_Memory64: WasmEdge_Proposal = 15;
pub const WasmEdge_Proposal_Threads: WasmEdge_Proposal = 16;
pub const WasmEdge_Proposal_Component: WasmEdge_Proposal = 17;
pub type WasmEdge_Proposal = ::std::os::raw::c_uint;
pub const WasmEdge_HostRegistration_Wasi: WasmEdge_HostRegistration = 0;
pub type WasmEdge_HostRegistration = ::std::os::raw::c_uint;
pub const WasmEdge_CompilerOptimizationLevel_O0: WasmEdge_CompilerOptimizationLevel = 0;
pub const WasmEdge_CompilerOptimizationLevel_O1: WasmEdge_CompilerOptimizationLevel = 1;
pub const WasmEdge_CompilerOptimizationLevel_O2: WasmEdge_CompilerOptimizationLevel = 2;
pub const WasmEdge_CompilerOptimizationLevel_O3: WasmEdge_CompilerOptimizationLevel = 3;
pub const WasmEdge_CompilerOptimizationLevel_Os: WasmEdge_CompilerOptimizationLevel = 4;
pub const WasmEdge_CompilerOptimizationLevel_Oz: WasmEdge_CompilerOptimizationLevel = 5;
pub type WasmEdge_CompilerOptimizationLevel = ::std::os::raw::c_uint;
pub const WasmEdge_CompilerOutputFormat_Native: WasmEdge_CompilerOutputFormat = 0;
pub const WasmEdge_CompilerOutputFormat_Wasm: WasmEdge_CompilerOutputFormat = 1;
pub type WasmEdge_CompilerOutputFormat = ::std::os::raw::c_uint;
pub const WasmEdge_ErrCategory_WASM: WasmEdge_ErrCategory = 0;
pub const WasmEdge_ErrCategory_UserLevelError: WasmEdge_ErrCategory = 1;
pub type WasmEdge_ErrCategory = ::std::os::raw::c_uint;
pub const WasmEdge_ErrCode_Success: WasmEdge_ErrCode = 0;
pub const WasmEdge_ErrCode_Terminated: WasmEdge_ErrCode = 1;
pub const WasmEdge_ErrCode_RuntimeError: WasmEdge_ErrCode = 2;
pub const WasmEdge_ErrCode_CostLimitExceeded: WasmEdge_ErrCode = 3;
pub const WasmEdge_ErrCode_WrongVMWorkflow: WasmEdge_ErrCode = 4;
pub const WasmEdge_ErrCode_FuncNotFound: WasmEdge_ErrCode = 5;
pub const WasmEdge_ErrCode_AOTDisabled: WasmEdge_ErrCode = 6;
pub const WasmEdge_ErrCode_Interrupted: WasmEdge_ErrCode = 7;
pub const WasmEdge_ErrCode_NotValidated: WasmEdge_ErrCode = 8;
pub const WasmEdge_ErrCode_NonNullRequired: WasmEdge_ErrCode = 9;
pub const WasmEdge_ErrCode_SetValueToConst: WasmEdge_ErrCode = 10;
pub const WasmEdge_ErrCode_SetValueErrorType: WasmEdge_ErrCode = 11;
pub const WasmEdge_ErrCode_UserDefError: WasmEdge_ErrCode = 12;
pub const WasmEdge_ErrCode_InvalidAOTConfigure: WasmEdge_ErrCode = 13;
pub const WasmEdge_ErrCode_AOTNotImpl: WasmEdge_ErrCode = 14;
pub const WasmEdge_ErrCode_IllegalPath: WasmEdge_ErrCode = 256;
pub const WasmEdge_ErrCode_ReadError: WasmEdge_ErrCode = 257;
pub const WasmEdge_ErrCode_UnexpectedEnd: WasmEdge_ErrCode = 258;
pub const WasmEdge_ErrCode_MalformedMagic: WasmEdge_ErrCode = 259;
pub const WasmEdge_ErrCode_MalformedVersion: WasmEdge_ErrCode = 260;
pub const WasmEdge_ErrCode_MalformedSection: WasmEdge_ErrCode = 261;
pub const WasmEdge_ErrCode_SectionSizeMismatch: WasmEdge_ErrCode = 262;
pub const WasmEdge_ErrCode_LengthOutOfBounds: WasmEdge_ErrCode = 263;
pub const WasmEdge_ErrCode_JunkSection: WasmEdge_ErrCode = 264;
pub const WasmEdge_ErrCode_IncompatibleFuncCode: WasmEdge_ErrCode = 265;
pub const WasmEdge_ErrCode_IncompatibleDataCount: WasmEdge_ErrCode = 266;
pub const WasmEdge_ErrCode_DataCountRequired: WasmEdge_ErrCode = 267;
pub const WasmEdge_ErrCode_MalformedImportKind: WasmEdge_ErrCode = 268;
pub const WasmEdge_ErrCode_MalformedExportKind: WasmEdge_ErrCode = 269;
pub const WasmEdge_ErrCode_ExpectedZeroByte: WasmEdge_ErrCode = 270;
pub const WasmEdge_ErrCode_InvalidMut: WasmEdge_ErrCode = 271;
pub const WasmEdge_ErrCode_TooManyLocals: WasmEdge_ErrCode = 272;
pub const WasmEdge_ErrCode_MalformedValType: WasmEdge_ErrCode = 273;
pub const WasmEdge_ErrCode_MalformedElemType: WasmEdge_ErrCode = 274;
pub const WasmEdge_ErrCode_MalformedRefType: WasmEdge_ErrCode = 275;
pub const WasmEdge_ErrCode_MalformedUTF8: WasmEdge_ErrCode = 276;
pub const WasmEdge_ErrCode_IntegerTooLarge: WasmEdge_ErrCode = 277;
pub const WasmEdge_ErrCode_IntegerTooLong: WasmEdge_ErrCode = 278;
pub const WasmEdge_ErrCode_IllegalOpCode: WasmEdge_ErrCode = 279;
pub const WasmEdge_ErrCode_ENDCodeExpected: WasmEdge_ErrCode = 280;
pub const WasmEdge_ErrCode_IllegalGrammar: WasmEdge_ErrCode = 281;
pub const WasmEdge_ErrCode_IntrinsicsTableNotFound: WasmEdge_ErrCode = 282;
pub const WasmEdge_ErrCode_MalformedTable: WasmEdge_ErrCode = 283;
pub const WasmEdge_ErrCode_MalformedMemoryOpFlags: WasmEdge_ErrCode = 284;
pub const WasmEdge_ErrCode_MalformedLimitFlags: WasmEdge_ErrCode = 285;
pub const WasmEdge_ErrCode_MalformedSort: WasmEdge_ErrCode = 416;
pub const WasmEdge_ErrCode_MalformedAliasTarget: WasmEdge_ErrCode = 417;
pub const WasmEdge_ErrCode_MalformedCoreInstance: WasmEdge_ErrCode = 418;
pub const WasmEdge_ErrCode_MalformedInstance: WasmEdge_ErrCode = 419;
pub const WasmEdge_ErrCode_MalformedDefType: WasmEdge_ErrCode = 420;
pub const WasmEdge_ErrCode_MalformedModuleType: WasmEdge_ErrCode = 421;
pub const WasmEdge_ErrCode_MalformedRecordType: WasmEdge_ErrCode = 422;
pub const WasmEdge_ErrCode_MalformedVariantType: WasmEdge_ErrCode = 423;
pub const WasmEdge_ErrCode_MalformedTupleType: WasmEdge_ErrCode = 424;
pub const WasmEdge_ErrCode_MalformedFlagsType: WasmEdge_ErrCode = 425;
pub const WasmEdge_ErrCode_MalformedCanonical: WasmEdge_ErrCode = 426;
pub const WasmEdge_ErrCode_UnknownCanonicalOption: WasmEdge_ErrCode = 427;
pub const WasmEdge_ErrCode_MalformedName: WasmEdge_ErrCode = 428;
pub const WasmEdge_ErrCode_ComponentNotImplLoader: WasmEdge_ErrCode = 429;
pub const WasmEdge_ErrCode_InvalidAlignment: WasmEdge_ErrCode = 512;
pub const WasmEdge_ErrCode_AlignmentTooLarge: WasmEdge_ErrCode = 513;
pub const WasmEdge_ErrCode_TypeCheckFailed: WasmEdge_ErrCode = 514;
pub const WasmEdge_ErrCode_InvalidLabelIdx: WasmEdge_ErrCode = 515;
pub const WasmEdge_ErrCode_InvalidLocalIdx: WasmEdge_ErrCode = 516;
pub const WasmEdge_ErrCode_InvalidFieldIdx: WasmEdge_ErrCode = 517;
pub const WasmEdge_ErrCode_InvalidFuncTypeIdx: WasmEdge_ErrCode = 518;
pub const WasmEdge_ErrCode_InvalidFuncIdx: WasmEdge_ErrCode = 519;
pub const WasmEdge_ErrCode_InvalidTableIdx: WasmEdge_ErrCode = 520;
pub const WasmEdge_ErrCode_InvalidMemoryIdx: WasmEdge_ErrCode = 521;
pub const WasmEdge_ErrCode_InvalidGlobalIdx: WasmEdge_ErrCode = 522;
pub const WasmEdge_ErrCode_InvalidTagIdx: WasmEdge_ErrCode = 523;
pub const WasmEdge_ErrCode_InvalidElemIdx: WasmEdge_ErrCode = 524;
pub const WasmEdge_ErrCode_InvalidDataIdx: WasmEdge_ErrCode = 525;
pub const WasmEdge_ErrCode_InvalidRefIdx: WasmEdge_ErrCode = 526;
pub const WasmEdge_ErrCode_ConstExprRequired: WasmEdge_ErrCode = 527;
pub const WasmEdge_ErrCode_DupExportName: WasmEdge_ErrCode = 528;
pub const WasmEdge_ErrCode_ImmutableGlobal: WasmEdge_ErrCode = 529;
pub const WasmEdge_ErrCode_ImmutableField: WasmEdge_ErrCode = 530;
pub const WasmEdge_ErrCode_ImmutableArray: WasmEdge_ErrCode = 531;
pub const WasmEdge_ErrCode_InvalidResultArity: WasmEdge_ErrCode = 532;
pub const WasmEdge_ErrCode_MultiTables: WasmEdge_ErrCode = 533;
pub const WasmEdge_ErrCode_MultiMemories: WasmEdge_ErrCode = 534;
pub const WasmEdge_ErrCode_InvalidLimit: WasmEdge_ErrCode = 535;
pub const WasmEdge_ErrCode_InvalidMemPages: WasmEdge_ErrCode = 536;
pub const WasmEdge_ErrCode_InvalidStartFunc: WasmEdge_ErrCode = 537;
pub const WasmEdge_ErrCode_InvalidLaneIdx: WasmEdge_ErrCode = 538;
pub const WasmEdge_ErrCode_InvalidUninitLocal: WasmEdge_ErrCode = 539;
pub const WasmEdge_ErrCode_InvalidNotDefaultableField: WasmEdge_ErrCode = 540;
pub const WasmEdge_ErrCode_InvalidNotDefaultableArray: WasmEdge_ErrCode = 541;
pub const WasmEdge_ErrCode_InvalidPackedField: WasmEdge_ErrCode = 542;
pub const WasmEdge_ErrCode_InvalidPackedArray: WasmEdge_ErrCode = 543;
pub const WasmEdge_ErrCode_InvalidUnpackedField: WasmEdge_ErrCode = 544;
pub const WasmEdge_ErrCode_InvalidUnpackedArray: WasmEdge_ErrCode = 545;
pub const WasmEdge_ErrCode_InvalidBrRefType: WasmEdge_ErrCode = 546;
pub const WasmEdge_ErrCode_ArrayTypesMismatch: WasmEdge_ErrCode = 547;
pub const WasmEdge_ErrCode_ArrayTypesNumtypeRequired: WasmEdge_ErrCode = 548;
pub const WasmEdge_ErrCode_InvalidSubType: WasmEdge_ErrCode = 549;
pub const WasmEdge_ErrCode_InvalidTagResultType: WasmEdge_ErrCode = 550;
pub const WasmEdge_ErrCode_SharedMemoryNoMax: WasmEdge_ErrCode = 551;
pub const WasmEdge_ErrCode_InvalidMemPages64: WasmEdge_ErrCode = 552;
pub const WasmEdge_ErrCode_MissingArgument: WasmEdge_ErrCode = 672;
pub const WasmEdge_ErrCode_ArgTypeMismatch: WasmEdge_ErrCode = 673;
pub const WasmEdge_ErrCode_InvalidIndex: WasmEdge_ErrCode = 674;
pub const WasmEdge_ErrCode_InvalidTypeReference: WasmEdge_ErrCode = 675;
pub const WasmEdge_ErrCode_ExportNotFound: WasmEdge_ErrCode = 676;
pub const WasmEdge_ErrCode_ComponentNotImplValidator: WasmEdge_ErrCode = 677;
pub const WasmEdge_ErrCode_ModuleNameConflict: WasmEdge_ErrCode = 768;
pub const WasmEdge_ErrCode_IncompatibleImportType: WasmEdge_ErrCode = 769;
pub const WasmEdge_ErrCode_UnknownImport: WasmEdge_ErrCode = 770;
pub const WasmEdge_ErrCode_DataSegDoesNotFit: WasmEdge_ErrCode = 771;
pub const WasmEdge_ErrCode_ElemSegDoesNotFit: WasmEdge_ErrCode = 772;
pub const WasmEdge_ErrCode_InvalidCoreSort: WasmEdge_ErrCode = 928;
pub const WasmEdge_ErrCode_InvalidCanonOption: WasmEdge_ErrCode = 929;
pub const WasmEdge_ErrCode_CoreInvalidExport: WasmEdge_ErrCode = 930;
pub const WasmEdge_ErrCode_ResourceDropArgument: WasmEdge_ErrCode = 931;
pub const WasmEdge_ErrCode_ComponentNotImplInstantiate: WasmEdge_ErrCode = 932;
pub const WasmEdge_ErrCode_WrongInstanceAddress: WasmEdge_ErrCode = 1024;
pub const WasmEdge_ErrCode_WrongInstanceIndex: WasmEdge_ErrCode = 1025;
pub const WasmEdge_ErrCode_InstrTypeMismatch: WasmEdge_ErrCode = 1026;
pub const WasmEdge_ErrCode_FuncSigMismatch: WasmEdge_ErrCode = 1027;
pub const WasmEdge_ErrCode_DivideByZero: WasmEdge_ErrCode = 1028;
pub const WasmEdge_ErrCode_IntegerOverflow: WasmEdge_ErrCode = 1029;
pub const WasmEdge_ErrCode_InvalidConvToInt: WasmEdge_ErrCode = 1030;
pub const WasmEdge_ErrCode_TableOutOfBounds: WasmEdge_ErrCode = 1031;
pub const WasmEdge_ErrCode_MemoryOutOfBounds: WasmEdge_ErrCode = 1032;
pub const WasmEdge_ErrCode_ArrayOutOfBounds: WasmEdge_ErrCode = 1033;
pub const WasmEdge_ErrCode_Unreachable: WasmEdge_ErrCode = 1034;
pub const WasmEdge_ErrCode_UninitializedElement: WasmEdge_ErrCode = 1035;
pub const WasmEdge_ErrCode_UndefinedElement: WasmEdge_ErrCode = 1036;
pub const WasmEdge_ErrCode_IndirectCallTypeMismatch: WasmEdge_ErrCode = 1037;
pub const WasmEdge_ErrCode_HostFuncError: WasmEdge_ErrCode = 1038;
pub const WasmEdge_ErrCode_RefTypeMismatch: WasmEdge_ErrCode = 1039;
pub const WasmEdge_ErrCode_UnalignedAtomicAccess: WasmEdge_ErrCode = 1040;
pub const WasmEdge_ErrCode_ExpectSharedMemory: WasmEdge_ErrCode = 1041;
pub const WasmEdge_ErrCode_CastNullToNonNull: WasmEdge_ErrCode = 1042;
pub const WasmEdge_ErrCode_AccessNullFunc: WasmEdge_ErrCode = 1043;
pub const WasmEdge_ErrCode_AccessNullStruct: WasmEdge_ErrCode = 1044;
pub const WasmEdge_ErrCode_AccessNullArray: WasmEdge_ErrCode = 1045;
pub const WasmEdge_ErrCode_AccessNullI31: WasmEdge_ErrCode = 1046;
pub const WasmEdge_ErrCode_AccessNullException: WasmEdge_ErrCode = 1047;
pub const WasmEdge_ErrCode_CastFailed: WasmEdge_ErrCode = 1048;
pub const WasmEdge_ErrCode_UncaughtException: WasmEdge_ErrCode = 1049;
pub type WasmEdge_ErrCode = ::std::os::raw::c_uint;
pub const WasmEdge_TypeCode_TypeIndex: WasmEdge_TypeCode = 0;
pub const WasmEdge_TypeCode_I32: WasmEdge_TypeCode = 127;
pub const WasmEdge_TypeCode_I64: WasmEdge_TypeCode = 126;
pub const WasmEdge_TypeCode_F32: WasmEdge_TypeCode = 125;
pub const WasmEdge_TypeCode_F64: WasmEdge_TypeCode = 124;
pub const WasmEdge_TypeCode_V128: WasmEdge_TypeCode = 123;
pub const WasmEdge_TypeCode_I8: WasmEdge_TypeCode = 120;
pub const WasmEdge_TypeCode_I16: WasmEdge_TypeCode = 119;
pub const WasmEdge_TypeCode_NullExnRef: WasmEdge_TypeCode = 116;
pub const WasmEdge_TypeCode_NullFuncRef: WasmEdge_TypeCode = 115;
pub const WasmEdge_TypeCode_NullExternRef: WasmEdge_TypeCode = 114;
pub const WasmEdge_TypeCode_NullRef: WasmEdge_TypeCode = 113;
pub const WasmEdge_TypeCode_FuncRef: WasmEdge_TypeCode = 112;
pub const WasmEdge_TypeCode_ExternRef: WasmEdge_TypeCode = 111;
pub const WasmEdge_TypeCode_AnyRef: WasmEdge_TypeCode = 110;
pub const WasmEdge_TypeCode_EqRef: WasmEdge_TypeCode = 109;
pub const WasmEdge_TypeCode_I31Ref: WasmEdge_TypeCode = 108;
pub const WasmEdge_TypeCode_StructRef: WasmEdge_TypeCode = 107;
pub const WasmEdge_TypeCode_ArrayRef: WasmEdge_TypeCode = 106;
pub const WasmEdge_TypeCode_ExnRef: WasmEdge_TypeCode = 105;
pub const WasmEdge_TypeCode_Ref: WasmEdge_TypeCode = 100;
pub const WasmEdge_TypeCode_RefNull: WasmEdge_TypeCode = 99;
pub const WasmEdge_TypeCode_Func: WasmEdge_TypeCode = 96;
pub const WasmEdge_TypeCode_Struct: WasmEdge_TypeCode = 95;
pub const WasmEdge_TypeCode_Array: WasmEdge_TypeCode = 94;
pub const WasmEdge_TypeCode_Sub: WasmEdge_TypeCode = 80;
pub const WasmEdge_TypeCode_SubFinal: WasmEdge_TypeCode = 79;
pub const WasmEdge_TypeCode_Rec: WasmEdge_TypeCode = 78;
pub const WasmEdge_TypeCode_Epsilon: WasmEdge_TypeCode = 64;
pub type WasmEdge_TypeCode = ::std::os::raw::c_uint;
pub const WasmEdge_Mutability_Const: WasmEdge_Mutability = 0;
pub const WasmEdge_Mutability_Var: WasmEdge_Mutability = 1;
pub type WasmEdge_Mutability = ::std::os::raw::c_uint;
pub const WasmEdge_ExternalType_Function: WasmEdge_ExternalType = 0;
pub const WasmEdge_ExternalType_Table: WasmEdge_ExternalType = 1;
pub const WasmEdge_ExternalType_Memory: WasmEdge_ExternalType = 2;
pub const WasmEdge_ExternalType_Global: WasmEdge_ExternalType = 3;
pub const WasmEdge_ExternalType_Tag: WasmEdge_ExternalType = 4;
pub type WasmEdge_ExternalType = ::std::os::raw::c_uint;
pub const WasmEdge_ComponentTypeCode_TypeIndex: WasmEdge_ComponentTypeCode = 0;
pub const WasmEdge_ComponentTypeCode_Bool: WasmEdge_ComponentTypeCode = 127;
pub const WasmEdge_ComponentTypeCode_S8: WasmEdge_ComponentTypeCode = 126;
pub const WasmEdge_ComponentTypeCode_U8: WasmEdge_ComponentTypeCode = 125;
pub const WasmEdge_ComponentTypeCode_S16: WasmEdge_ComponentTypeCode = 124;
pub const WasmEdge_ComponentTypeCode_U16: WasmEdge_ComponentTypeCode = 123;
pub const WasmEdge_ComponentTypeCode_S32: WasmEdge_ComponentTypeCode = 122;
pub const WasmEdge_ComponentTypeCode_U32: WasmEdge_ComponentTypeCode = 121;
pub const WasmEdge_ComponentTypeCode_S64: WasmEdge_ComponentTypeCode = 120;
pub const WasmEdge_ComponentTypeCode_U64: WasmEdge_ComponentTypeCode = 119;
pub const WasmEdge_ComponentTypeCode_F32: WasmEdge_ComponentTypeCode = 118;
pub const WasmEdge_ComponentTypeCode_F64: WasmEdge_ComponentTypeCode = 117;
pub const WasmEdge_ComponentTypeCode_Char: WasmEdge_ComponentTypeCode = 116;
pub const WasmEdge_ComponentTypeCode_String: WasmEdge_ComponentTypeCode = 115;
pub const WasmEdge_ComponentTypeCode_Record: WasmEdge_ComponentTypeCode = 114;
pub const WasmEdge_ComponentTypeCode_Variant: WasmEdge_ComponentTypeCode = 113;
pub const WasmEdge_ComponentTypeCode_List: WasmEdge_ComponentTypeCode = 112;
pub const WasmEdge_ComponentTypeCode_Tuple: WasmEdge_ComponentTypeCode = 111;
pub const WasmEdge_ComponentTypeCode_Flags: WasmEdge_ComponentTypeCode = 110;
pub const WasmEdge_ComponentTypeCode_Enum: WasmEdge_ComponentTypeCode = 109;
pub const WasmEdge_ComponentTypeCode_Option: WasmEdge_ComponentTypeCode = 107;
pub const WasmEdge_ComponentTypeCode_Result: WasmEdge_ComponentTypeCode = 106;
pub const WasmEdge_ComponentTypeCode_Own: WasmEdge_ComponentTypeCode = 105;
pub const WasmEdge_ComponentTypeCode_Borrow: WasmEdge_ComponentTypeCode = 104;
pub const WasmEdge_ComponentTypeCode_ListLen: WasmEdge_ComponentTypeCode = 103;
pub const WasmEdge_ComponentTypeCode_Stream: WasmEdge_ComponentTypeCode = 102;
pub const WasmEdge_ComponentTypeCode_Future: WasmEdge_ComponentTypeCode = 101;
pub const WasmEdge_ComponentTypeCode_ErrContext: WasmEdge_ComponentTypeCode = 100;
pub type WasmEdge_ComponentTypeCode = ::std::os::raw::c_uint;
pub type uint128_t = u128;
pub type int128_t = i128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_String {
    pub Length: u32,
    pub Buf: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_WasmEdge_String() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_String> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_String>(),
        16usize,
        concat!("Size of: ", stringify!(WasmEdge_String))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_String>(),
        8usize,
        concat!("Alignment of ", stringify!(WasmEdge_String))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_String),
            "::",
            stringify!(Length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_String),
            "::",
            stringify!(Buf)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_Bytes {
    pub Length: u32,
    pub Buf: *const u8,
}
#[test]
fn bindgen_test_layout_WasmEdge_Bytes() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_Bytes> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_Bytes>(),
        16usize,
        concat!("Size of: ", stringify!(WasmEdge_Bytes))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_Bytes>(),
        8usize,
        concat!("Alignment of ", stringify!(WasmEdge_Bytes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Bytes),
            "::",
            stringify!(Length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Buf) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Bytes),
            "::",
            stringify!(Buf)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_Result {
    pub Code: u32,
}
#[test]
fn bindgen_test_layout_WasmEdge_Result() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_Result> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_Result>(),
        4usize,
        concat!("Size of: ", stringify!(WasmEdge_Result))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_Result>(),
        4usize,
        concat!("Alignment of ", stringify!(WasmEdge_Result))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Code) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Result),
            "::",
            stringify!(Code)
        )
    );
}
extern "C" {
    pub fn WasmEdge_VersionGet() -> *const ::std::os::raw::c_char;
}
extern "C" {
    pub fn WasmEdge_VersionGetMajor() -> u32;
}
extern "C" {
    pub fn WasmEdge_VersionGetMinor() -> u32;
}
extern "C" {
    pub fn WasmEdge_VersionGetPatch() -> u32;
}
extern "C" {
    pub fn WasmEdge_LogSetErrorLevel();
}
extern "C" {
    pub fn WasmEdge_LogSetDebugLevel();
}
extern "C" {
    pub fn WasmEdge_LogOff();
}
pub const WasmEdge_LogLevel_Trace: WasmEdge_LogLevel = 0;
pub const WasmEdge_LogLevel_Debug: WasmEdge_LogLevel = 1;
pub const WasmEdge_LogLevel_Info: WasmEdge_LogLevel = 2;
pub const WasmEdge_LogLevel_Warn: WasmEdge_LogLevel = 3;
pub const WasmEdge_LogLevel_Error: WasmEdge_LogLevel = 4;
pub const WasmEdge_LogLevel_Critical: WasmEdge_LogLevel = 5;
pub type WasmEdge_LogLevel = ::std::os::raw::c_uint;
extern "C" {
    pub fn WasmEdge_LogSetLevel(Level: WasmEdge_LogLevel);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_LogMessage {
    pub Message: WasmEdge_String,
    pub LoggerName: WasmEdge_String,
    pub Level: WasmEdge_LogLevel,
    pub Time: time_t,
    pub ThreadId: u64,
}
#[test]
fn bindgen_test_layout_WasmEdge_LogMessage() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_LogMessage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_LogMessage>(),
        56usize,
        concat!("Size of: ", stringify!(WasmEdge_LogMessage))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_LogMessage>(),
        8usize,
        concat!("Alignment of ", stringify!(WasmEdge_LogMessage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Message) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_LogMessage),
            "::",
            stringify!(Message)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).LoggerName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_LogMessage),
            "::",
            stringify!(LoggerName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Level) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_LogMessage),
            "::",
            stringify!(Level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Time) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_LogMessage),
            "::",
            stringify!(Time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ThreadId) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_LogMessage),
            "::",
            stringify!(ThreadId)
        )
    );
}
pub type WasmEdge_LogCallback_t =
    ::std::option::Option<unsafe extern "C" fn(Message: *const WasmEdge_LogMessage)>;
extern "C" {
    pub fn WasmEdge_LogSetCallback(Callback: WasmEdge_LogCallback_t);
}
extern "C" {
    pub fn WasmEdge_StringCreateByCString(Str: *const ::std::os::raw::c_char) -> WasmEdge_String;
}
extern "C" {
    pub fn WasmEdge_StringCreateByBuffer(
        Buf: *const ::std::os::raw::c_char,
        Len: u32,
    ) -> WasmEdge_String;
}
extern "C" {
    pub fn WasmEdge_StringWrap(Buf: *const ::std::os::raw::c_char, Len: u32) -> WasmEdge_String;
}
extern "C" {
    pub fn WasmEdge_StringIsEqual(Str1: WasmEdge_String, Str2: WasmEdge_String) -> bool;
}
extern "C" {
    pub fn WasmEdge_StringCopy(
        Str: WasmEdge_String,
        Buf: *mut ::std::os::raw::c_char,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_StringDelete(Str: WasmEdge_String);
}
extern "C" {
    pub fn WasmEdge_BytesCreate(Buf: *const u8, Len: u32) -> WasmEdge_Bytes;
}
extern "C" {
    pub fn WasmEdge_BytesWrap(Buf: *const u8, Len: u32) -> WasmEdge_Bytes;
}
extern "C" {
    pub fn WasmEdge_BytesDelete(Bytes: WasmEdge_Bytes);
}
extern "C" {
    pub fn WasmEdge_ResultOK(Res: WasmEdge_Result) -> bool;
}
extern "C" {
    pub fn WasmEdge_ResultGen(Category: WasmEdge_ErrCategory, Code: u32) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_ResultGetCode(Res: WasmEdge_Result) -> u32;
}
extern "C" {
    pub fn WasmEdge_ResultGetCategory(Res: WasmEdge_Result) -> WasmEdge_ErrCategory;
}
extern "C" {
    pub fn WasmEdge_ResultGetMessage(Res: WasmEdge_Result) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ValType {
    pub Data: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_WasmEdge_ValType() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_ValType> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_ValType>(),
        8usize,
        concat!("Size of: ", stringify!(WasmEdge_ValType))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_ValType>(),
        1usize,
        concat!("Alignment of ", stringify!(WasmEdge_ValType))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_ValType),
            "::",
            stringify!(Data)
        )
    );
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_Value {
    pub Value: uint128_t,
    pub Type: WasmEdge_ValType,
}
#[test]
fn bindgen_test_layout_WasmEdge_Value() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_Value> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_Value>(),
        32usize,
        concat!("Size of: ", stringify!(WasmEdge_Value))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_Value>(),
        16usize,
        concat!("Alignment of ", stringify!(WasmEdge_Value))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Value),
            "::",
            stringify!(Value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Value),
            "::",
            stringify!(Type)
        )
    );
}
extern "C" {
    pub fn WasmEdge_ValTypeGenI32() -> WasmEdge_ValType;
}
extern "C" {
    pub fn WasmEdge_ValTypeGenI64() -> WasmEdge_ValType;
}
extern "C" {
    pub fn WasmEdge_ValTypeGenF32() -> WasmEdge_ValType;
}
extern "C" {
    pub fn WasmEdge_ValTypeGenF64() -> WasmEdge_ValType;
}
extern "C" {
    pub fn WasmEdge_ValTypeGenV128() -> WasmEdge_ValType;
}
extern "C" {
    pub fn WasmEdge_ValTypeGenFuncRef() -> WasmEdge_ValType;
}
extern "C" {
    pub fn WasmEdge_ValTypeGenExternRef() -> WasmEdge_ValType;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsEqual(ValType1: WasmEdge_ValType, ValType2: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsI32(ValType: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsI64(ValType: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsF32(ValType: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsF64(ValType: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsV128(ValType: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsFuncRef(ValType: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsExternRef(ValType: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsRef(ValType: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValTypeIsRefNull(ValType: WasmEdge_ValType) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValueGenI32(Val: i32) -> WasmEdge_Value;
}
extern "C" {
    pub fn WasmEdge_ValueGenI64(Val: i64) -> WasmEdge_Value;
}
extern "C" {
    pub fn WasmEdge_ValueGenF32(Val: f32) -> WasmEdge_Value;
}
extern "C" {
    pub fn WasmEdge_ValueGenF64(Val: f64) -> WasmEdge_Value;
}
extern "C" {
    pub fn WasmEdge_ValueGenV128(Val: int128_t) -> WasmEdge_Value;
}
extern "C" {
    pub fn WasmEdge_ValueGenFuncRef(Cxt: *const WasmEdge_FunctionInstanceContext)
        -> WasmEdge_Value;
}
extern "C" {
    pub fn WasmEdge_ValueGenExternRef(Ref: *mut ::std::os::raw::c_void) -> WasmEdge_Value;
}
extern "C" {
    pub fn WasmEdge_ValueGetI32(Val: WasmEdge_Value) -> i32;
}
extern "C" {
    pub fn WasmEdge_ValueGetI64(Val: WasmEdge_Value) -> i64;
}
extern "C" {
    pub fn WasmEdge_ValueGetF32(Val: WasmEdge_Value) -> f32;
}
extern "C" {
    pub fn WasmEdge_ValueGetF64(Val: WasmEdge_Value) -> f64;
}
extern "C" {
    pub fn WasmEdge_ValueGetV128(Val: WasmEdge_Value) -> int128_t;
}
extern "C" {
    pub fn WasmEdge_ValueIsNullRef(Val: WasmEdge_Value) -> bool;
}
extern "C" {
    pub fn WasmEdge_ValueGetFuncRef(Val: WasmEdge_Value)
        -> *const WasmEdge_FunctionInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ValueGetExternRef(Val: WasmEdge_Value) -> *mut ::std::os::raw::c_void;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_Limit {
    pub HasMax: bool,
    pub Shared: bool,
    pub Min: u32,
    pub Max: u32,
}
#[test]
fn bindgen_test_layout_WasmEdge_Limit() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_Limit> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_Limit>(),
        12usize,
        concat!("Size of: ", stringify!(WasmEdge_Limit))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_Limit>(),
        4usize,
        concat!("Alignment of ", stringify!(WasmEdge_Limit))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).HasMax) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Limit),
            "::",
            stringify!(HasMax)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Shared) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Limit),
            "::",
            stringify!(Shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Min) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Limit),
            "::",
            stringify!(Min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_Limit),
            "::",
            stringify!(Max)
        )
    );
}
extern "C" {
    pub fn WasmEdge_LimitIsEqual(Lim1: WasmEdge_Limit, Lim2: WasmEdge_Limit) -> bool;
}
extern "C" {
    pub fn WasmEdge_ASTModuleListImportsLength(Cxt: *const WasmEdge_ASTModuleContext) -> u32;
}
extern "C" {
    pub fn WasmEdge_ASTModuleListImports(
        Cxt: *const WasmEdge_ASTModuleContext,
        Imports: *mut *const WasmEdge_ImportTypeContext,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ASTModuleListExportsLength(Cxt: *const WasmEdge_ASTModuleContext) -> u32;
}
extern "C" {
    pub fn WasmEdge_ASTModuleListExports(
        Cxt: *const WasmEdge_ASTModuleContext,
        Exports: *mut *const WasmEdge_ExportTypeContext,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ASTModuleDelete(Cxt: *mut WasmEdge_ASTModuleContext);
}
extern "C" {
    pub fn WasmEdge_FunctionTypeCreate(
        ParamList: *const WasmEdge_ValType,
        ParamLen: u32,
        ReturnList: *const WasmEdge_ValType,
        ReturnLen: u32,
    ) -> *mut WasmEdge_FunctionTypeContext;
}
extern "C" {
    pub fn WasmEdge_FunctionTypeGetParametersLength(
        Cxt: *const WasmEdge_FunctionTypeContext,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_FunctionTypeGetParameters(
        Cxt: *const WasmEdge_FunctionTypeContext,
        List: *mut WasmEdge_ValType,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_FunctionTypeGetReturnsLength(Cxt: *const WasmEdge_FunctionTypeContext) -> u32;
}
extern "C" {
    pub fn WasmEdge_FunctionTypeGetReturns(
        Cxt: *const WasmEdge_FunctionTypeContext,
        List: *mut WasmEdge_ValType,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_FunctionTypeDelete(Cxt: *mut WasmEdge_FunctionTypeContext);
}
extern "C" {
    pub fn WasmEdge_TableTypeCreate(
        RefType: WasmEdge_ValType,
        Limit: WasmEdge_Limit,
    ) -> *mut WasmEdge_TableTypeContext;
}
extern "C" {
    pub fn WasmEdge_TableTypeGetRefType(Cxt: *const WasmEdge_TableTypeContext) -> WasmEdge_ValType;
}
extern "C" {
    pub fn WasmEdge_TableTypeGetLimit(Cxt: *const WasmEdge_TableTypeContext) -> WasmEdge_Limit;
}
extern "C" {
    pub fn WasmEdge_TableTypeDelete(Cxt: *mut WasmEdge_TableTypeContext);
}
extern "C" {
    pub fn WasmEdge_MemoryTypeCreate(Limit: WasmEdge_Limit) -> *mut WasmEdge_MemoryTypeContext;
}
extern "C" {
    pub fn WasmEdge_MemoryTypeGetLimit(Cxt: *const WasmEdge_MemoryTypeContext) -> WasmEdge_Limit;
}
extern "C" {
    pub fn WasmEdge_MemoryTypeDelete(Cxt: *mut WasmEdge_MemoryTypeContext);
}
extern "C" {
    pub fn WasmEdge_TagTypeGetFunctionType(
        Cxt: *const WasmEdge_TagTypeContext,
    ) -> *const WasmEdge_FunctionTypeContext;
}
extern "C" {
    pub fn WasmEdge_GlobalTypeCreate(
        ValType: WasmEdge_ValType,
        Mut: WasmEdge_Mutability,
    ) -> *mut WasmEdge_GlobalTypeContext;
}
extern "C" {
    pub fn WasmEdge_GlobalTypeGetValType(
        Cxt: *const WasmEdge_GlobalTypeContext,
    ) -> WasmEdge_ValType;
}
extern "C" {
    pub fn WasmEdge_GlobalTypeGetMutability(
        Cxt: *const WasmEdge_GlobalTypeContext,
    ) -> WasmEdge_Mutability;
}
extern "C" {
    pub fn WasmEdge_GlobalTypeDelete(Cxt: *mut WasmEdge_GlobalTypeContext);
}
extern "C" {
    pub fn WasmEdge_ImportTypeGetExternalType(
        Cxt: *const WasmEdge_ImportTypeContext,
    ) -> WasmEdge_ExternalType;
}
extern "C" {
    pub fn WasmEdge_ImportTypeGetModuleName(
        Cxt: *const WasmEdge_ImportTypeContext,
    ) -> WasmEdge_String;
}
extern "C" {
    pub fn WasmEdge_ImportTypeGetExternalName(
        Cxt: *const WasmEdge_ImportTypeContext,
    ) -> WasmEdge_String;
}
extern "C" {
    pub fn WasmEdge_ImportTypeGetFunctionType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ImportTypeContext,
    ) -> *const WasmEdge_FunctionTypeContext;
}
extern "C" {
    pub fn WasmEdge_ImportTypeGetTableType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ImportTypeContext,
    ) -> *const WasmEdge_TableTypeContext;
}
extern "C" {
    pub fn WasmEdge_ImportTypeGetMemoryType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ImportTypeContext,
    ) -> *const WasmEdge_MemoryTypeContext;
}
extern "C" {
    pub fn WasmEdge_ImportTypeGetTagType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ImportTypeContext,
    ) -> *const WasmEdge_TagTypeContext;
}
extern "C" {
    pub fn WasmEdge_ImportTypeGetGlobalType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ImportTypeContext,
    ) -> *const WasmEdge_GlobalTypeContext;
}
extern "C" {
    pub fn WasmEdge_ExportTypeGetExternalType(
        Cxt: *const WasmEdge_ExportTypeContext,
    ) -> WasmEdge_ExternalType;
}
extern "C" {
    pub fn WasmEdge_ExportTypeGetExternalName(
        Cxt: *const WasmEdge_ExportTypeContext,
    ) -> WasmEdge_String;
}
extern "C" {
    pub fn WasmEdge_ExportTypeGetFunctionType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ExportTypeContext,
    ) -> *const WasmEdge_FunctionTypeContext;
}
extern "C" {
    pub fn WasmEdge_ExportTypeGetTableType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ExportTypeContext,
    ) -> *const WasmEdge_TableTypeContext;
}
extern "C" {
    pub fn WasmEdge_ExportTypeGetMemoryType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ExportTypeContext,
    ) -> *const WasmEdge_MemoryTypeContext;
}
extern "C" {
    pub fn WasmEdge_ExportTypeGetTagType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ExportTypeContext,
    ) -> *const WasmEdge_TagTypeContext;
}
extern "C" {
    pub fn WasmEdge_ExportTypeGetGlobalType(
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Cxt: *const WasmEdge_ExportTypeContext,
    ) -> *const WasmEdge_GlobalTypeContext;
}
extern "C" {
    pub fn WasmEdge_CompilerCreate(
        ConfCxt: *const WasmEdge_ConfigureContext,
    ) -> *mut WasmEdge_CompilerContext;
}
extern "C" {
    pub fn WasmEdge_CompilerCompile(
        Cxt: *mut WasmEdge_CompilerContext,
        InPath: *const ::std::os::raw::c_char,
        OutPath: *const ::std::os::raw::c_char,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_CompilerCompileFromBytes(
        Cxt: *mut WasmEdge_CompilerContext,
        Bytes: WasmEdge_Bytes,
        OutPath: *const ::std::os::raw::c_char,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_CompilerDelete(Cxt: *mut WasmEdge_CompilerContext);
}
extern "C" {
    pub fn WasmEdge_LoaderParseFromBuffer(
        Cxt: *mut WasmEdge_LoaderContext,
        Module: *mut *mut WasmEdge_ASTModuleContext,
        Buf: *const u8,
        BufLen: u32,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_ConfigureCreate() -> *mut WasmEdge_ConfigureContext;
}
extern "C" {
    pub fn WasmEdge_ConfigureAddProposal(
        Cxt: *mut WasmEdge_ConfigureContext,
        Prop: WasmEdge_Proposal,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureRemoveProposal(
        Cxt: *mut WasmEdge_ConfigureContext,
        Prop: WasmEdge_Proposal,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureHasProposal(
        Cxt: *const WasmEdge_ConfigureContext,
        Prop: WasmEdge_Proposal,
    ) -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureSetWASMStandard(
        Cxt: *mut WasmEdge_ConfigureContext,
        Std: WasmEdge_Standard,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureAddHostRegistration(
        Cxt: *mut WasmEdge_ConfigureContext,
        Host: WasmEdge_HostRegistration,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureRemoveHostRegistration(
        Cxt: *mut WasmEdge_ConfigureContext,
        Host: WasmEdge_HostRegistration,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureHasHostRegistration(
        Cxt: *const WasmEdge_ConfigureContext,
        Host: WasmEdge_HostRegistration,
    ) -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureSetMaxMemoryPage(Cxt: *mut WasmEdge_ConfigureContext, Page: u32);
}
extern "C" {
    pub fn WasmEdge_ConfigureGetMaxMemoryPage(Cxt: *const WasmEdge_ConfigureContext) -> u32;
}
extern "C" {
    pub fn WasmEdge_ConfigureSetForceInterpreter(
        Cxt: *mut WasmEdge_ConfigureContext,
        IsForceInterpreter: bool,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureIsForceInterpreter(Cxt: *const WasmEdge_ConfigureContext) -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureSetAllowAFUNIX(
        Cxt: *mut WasmEdge_ConfigureContext,
        EnableAFUNIX: bool,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureIsAllowAFUNIX(Cxt: *const WasmEdge_ConfigureContext) -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerSetOptimizationLevel(
        Cxt: *mut WasmEdge_ConfigureContext,
        Level: WasmEdge_CompilerOptimizationLevel,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerGetOptimizationLevel(
        Cxt: *const WasmEdge_ConfigureContext,
    ) -> WasmEdge_CompilerOptimizationLevel;
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerSetOutputFormat(
        Cxt: *mut WasmEdge_ConfigureContext,
        Format: WasmEdge_CompilerOutputFormat,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerGetOutputFormat(
        Cxt: *const WasmEdge_ConfigureContext,
    ) -> WasmEdge_CompilerOutputFormat;
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerSetDumpIR(Cxt: *mut WasmEdge_ConfigureContext, IsDump: bool);
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerIsDumpIR(Cxt: *const WasmEdge_ConfigureContext) -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerSetGenericBinary(
        Cxt: *mut WasmEdge_ConfigureContext,
        IsGeneric: bool,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerIsGenericBinary(Cxt: *const WasmEdge_ConfigureContext)
        -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerSetInterruptible(
        Cxt: *mut WasmEdge_ConfigureContext,
        IsInterruptible: bool,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureCompilerIsInterruptible(Cxt: *const WasmEdge_ConfigureContext)
        -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureStatisticsSetInstructionCounting(
        Cxt: *mut WasmEdge_ConfigureContext,
        IsCount: bool,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureStatisticsIsInstructionCounting(
        Cxt: *const WasmEdge_ConfigureContext,
    ) -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureStatisticsSetCostMeasuring(
        Cxt: *mut WasmEdge_ConfigureContext,
        IsMeasure: bool,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureStatisticsIsCostMeasuring(
        Cxt: *const WasmEdge_ConfigureContext,
    ) -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureStatisticsSetTimeMeasuring(
        Cxt: *mut WasmEdge_ConfigureContext,
        IsMeasure: bool,
    );
}
extern "C" {
    pub fn WasmEdge_ConfigureStatisticsIsTimeMeasuring(
        Cxt: *const WasmEdge_ConfigureContext,
    ) -> bool;
}
extern "C" {
    pub fn WasmEdge_ConfigureDelete(Cxt: *mut WasmEdge_ConfigureContext);
}
extern "C" {
    pub fn WasmEdge_StatisticsCreate() -> *mut WasmEdge_StatisticsContext;
}
extern "C" {
    pub fn WasmEdge_StatisticsGetInstrCount(Cxt: *const WasmEdge_StatisticsContext) -> u64;
}
extern "C" {
    pub fn WasmEdge_StatisticsGetInstrPerSecond(Cxt: *const WasmEdge_StatisticsContext) -> f64;
}
extern "C" {
    pub fn WasmEdge_StatisticsGetTotalCost(Cxt: *const WasmEdge_StatisticsContext) -> u64;
}
extern "C" {
    pub fn WasmEdge_StatisticsSetCostTable(
        Cxt: *mut WasmEdge_StatisticsContext,
        CostArr: *mut u64,
        Len: u32,
    );
}
extern "C" {
    pub fn WasmEdge_StatisticsSetCostLimit(Cxt: *mut WasmEdge_StatisticsContext, Limit: u64);
}
extern "C" {
    pub fn WasmEdge_StatisticsClear(Cxt: *mut WasmEdge_StatisticsContext);
}
extern "C" {
    pub fn WasmEdge_StatisticsDelete(Cxt: *mut WasmEdge_StatisticsContext);
}
extern "C" {
    pub fn WasmEdge_LoaderCreate(
        ConfCxt: *const WasmEdge_ConfigureContext,
    ) -> *mut WasmEdge_LoaderContext;
}
extern "C" {
    pub fn WasmEdge_LoaderParseFromFile(
        Cxt: *mut WasmEdge_LoaderContext,
        Module: *mut *mut WasmEdge_ASTModuleContext,
        Path: *const ::std::os::raw::c_char,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_LoaderParseFromBytes(
        Cxt: *mut WasmEdge_LoaderContext,
        Module: *mut *mut WasmEdge_ASTModuleContext,
        Bytes: WasmEdge_Bytes,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_LoaderSerializeASTModule(
        Cxt: *mut WasmEdge_LoaderContext,
        ASTCxt: *const WasmEdge_ASTModuleContext,
        Buf: *mut WasmEdge_Bytes,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_LoaderDelete(Cxt: *mut WasmEdge_LoaderContext);
}
extern "C" {
    pub fn WasmEdge_ValidatorCreate(
        ConfCxt: *const WasmEdge_ConfigureContext,
    ) -> *mut WasmEdge_ValidatorContext;
}
extern "C" {
    pub fn WasmEdge_ValidatorValidate(
        Cxt: *mut WasmEdge_ValidatorContext,
        ASTCxt: *const WasmEdge_ASTModuleContext,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_ValidatorDelete(Cxt: *mut WasmEdge_ValidatorContext);
}
extern "C" {
    pub fn WasmEdge_ExecutorCreate(
        ConfCxt: *const WasmEdge_ConfigureContext,
        StatCxt: *mut WasmEdge_StatisticsContext,
    ) -> *mut WasmEdge_ExecutorContext;
}
extern "C" {
    pub fn WasmEdge_ExecutorInstantiate(
        Cxt: *mut WasmEdge_ExecutorContext,
        ModuleCxt: *mut *mut WasmEdge_ModuleInstanceContext,
        StoreCxt: *mut WasmEdge_StoreContext,
        ASTCxt: *const WasmEdge_ASTModuleContext,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_ExecutorRegister(
        Cxt: *mut WasmEdge_ExecutorContext,
        ModuleCxt: *mut *mut WasmEdge_ModuleInstanceContext,
        StoreCxt: *mut WasmEdge_StoreContext,
        ASTCxt: *const WasmEdge_ASTModuleContext,
        ModuleName: WasmEdge_String,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_ExecutorRegisterImport(
        Cxt: *mut WasmEdge_ExecutorContext,
        StoreCxt: *mut WasmEdge_StoreContext,
        ImportCxt: *const WasmEdge_ModuleInstanceContext,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_ExecutorInvoke(
        Cxt: *mut WasmEdge_ExecutorContext,
        FuncCxt: *const WasmEdge_FunctionInstanceContext,
        Params: *const WasmEdge_Value,
        ParamLen: u32,
        Returns: *mut WasmEdge_Value,
        ReturnLen: u32,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_ExecutorAsyncInvoke(
        Cxt: *mut WasmEdge_ExecutorContext,
        FuncCxt: *const WasmEdge_FunctionInstanceContext,
        Params: *const WasmEdge_Value,
        ParamLen: u32,
    ) -> *mut WasmEdge_Async;
}
extern "C" {
    pub fn WasmEdge_ExecutorDelete(Cxt: *mut WasmEdge_ExecutorContext);
}
extern "C" {
    pub fn WasmEdge_StoreCreate() -> *mut WasmEdge_StoreContext;
}
extern "C" {
    pub fn WasmEdge_StoreFindModule(
        Cxt: *const WasmEdge_StoreContext,
        Name: WasmEdge_String,
    ) -> *const WasmEdge_ModuleInstanceContext;
}
extern "C" {
    pub fn WasmEdge_StoreListModuleLength(Cxt: *const WasmEdge_StoreContext) -> u32;
}
extern "C" {
    pub fn WasmEdge_StoreListModule(
        Cxt: *const WasmEdge_StoreContext,
        Names: *mut WasmEdge_String,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_StoreDelete(Cxt: *mut WasmEdge_StoreContext);
}
extern "C" {
    pub fn WasmEdge_CallingFrameGetExecutor(
        Cxt: *const WasmEdge_CallingFrameContext,
    ) -> *mut WasmEdge_ExecutorContext;
}
extern "C" {
    pub fn WasmEdge_CallingFrameGetModuleInstance(
        Cxt: *const WasmEdge_CallingFrameContext,
    ) -> *const WasmEdge_ModuleInstanceContext;
}
extern "C" {
    pub fn WasmEdge_CallingFrameGetMemoryInstance(
        Cxt: *const WasmEdge_CallingFrameContext,
        Idx: u32,
    ) -> *mut WasmEdge_MemoryInstanceContext;
}
extern "C" {
    pub fn WasmEdge_AsyncWait(Cxt: *const WasmEdge_Async);
}
extern "C" {
    pub fn WasmEdge_AsyncWaitFor(Cxt: *const WasmEdge_Async, Milliseconds: u64) -> bool;
}
extern "C" {
    pub fn WasmEdge_AsyncCancel(Cxt: *mut WasmEdge_Async);
}
extern "C" {
    pub fn WasmEdge_AsyncGetReturnsLength(Cxt: *const WasmEdge_Async) -> u32;
}
extern "C" {
    pub fn WasmEdge_AsyncGet(
        Cxt: *const WasmEdge_Async,
        Returns: *mut WasmEdge_Value,
        ReturnLen: u32,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_AsyncDelete(Cxt: *mut WasmEdge_Async);
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceCreate(
        ModuleName: WasmEdge_String,
    ) -> *mut WasmEdge_ModuleInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceCreateWithData(
        ModuleName: WasmEdge_String,
        HostData: *mut ::std::os::raw::c_void,
        Finalizer: ::std::option::Option<unsafe extern "C" fn(arg1: *mut ::std::os::raw::c_void)>,
    ) -> *mut WasmEdge_ModuleInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceCreateWASI(
        Args: *const *const ::std::os::raw::c_char,
        ArgLen: u32,
        Envs: *const *const ::std::os::raw::c_char,
        EnvLen: u32,
        Preopens: *const *const ::std::os::raw::c_char,
        PreopenLen: u32,
    ) -> *mut WasmEdge_ModuleInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceCreateWASIWithFds(
        Args: *const *const ::std::os::raw::c_char,
        ArgLen: u32,
        Envs: *const *const ::std::os::raw::c_char,
        EnvLen: u32,
        Preopens: *const *const ::std::os::raw::c_char,
        PreopenLen: u32,
        StdInFd: i32,
        StdOutFd: i32,
        StdErrFd: i32,
    ) -> *mut WasmEdge_ModuleInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceInitWASI(
        Cxt: *mut WasmEdge_ModuleInstanceContext,
        Args: *const *const ::std::os::raw::c_char,
        ArgLen: u32,
        Envs: *const *const ::std::os::raw::c_char,
        EnvLen: u32,
        Preopens: *const *const ::std::os::raw::c_char,
        PreopenLen: u32,
    );
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceInitWASIWithFds(
        Cxt: *mut WasmEdge_ModuleInstanceContext,
        Args: *const *const ::std::os::raw::c_char,
        ArgLen: u32,
        Envs: *const *const ::std::os::raw::c_char,
        EnvLen: u32,
        Preopens: *const *const ::std::os::raw::c_char,
        PreopenLen: u32,
        StdInFd: i32,
        StdOutFd: i32,
        StdErrFd: i32,
    );
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceWASIGetExitCode(
        Cxt: *const WasmEdge_ModuleInstanceContext,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceWASIGetNativeHandler(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Fd: i32,
        NativeHandler: *mut u64,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceInitWasmEdgeProcess(
        AllowedCmds: *const *const ::std::os::raw::c_char,
        CmdsLen: u32,
        AllowAll: bool,
    );
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceGetModuleName(
        Cxt: *const WasmEdge_ModuleInstanceContext,
    ) -> WasmEdge_String;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceGetHostData(
        Cxt: *const WasmEdge_ModuleInstanceContext,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceFindFunction(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Name: WasmEdge_String,
    ) -> *mut WasmEdge_FunctionInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceFindTable(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Name: WasmEdge_String,
    ) -> *mut WasmEdge_TableInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceFindMemory(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Name: WasmEdge_String,
    ) -> *mut WasmEdge_MemoryInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceFindTag(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Name: WasmEdge_String,
    ) -> *mut WasmEdge_TagInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceFindGlobal(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Name: WasmEdge_String,
    ) -> *mut WasmEdge_GlobalInstanceContext;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListFunctionLength(
        Cxt: *const WasmEdge_ModuleInstanceContext,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListFunction(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Names: *mut WasmEdge_String,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListTableLength(
        Cxt: *const WasmEdge_ModuleInstanceContext,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListTable(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Names: *mut WasmEdge_String,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListMemoryLength(
        Cxt: *const WasmEdge_ModuleInstanceContext,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListMemory(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Names: *mut WasmEdge_String,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListTagLength(Cxt: *const WasmEdge_ModuleInstanceContext) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListTag(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Names: *mut WasmEdge_String,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListGlobalLength(
        Cxt: *const WasmEdge_ModuleInstanceContext,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceListGlobal(
        Cxt: *const WasmEdge_ModuleInstanceContext,
        Names: *mut WasmEdge_String,
        Len: u32,
    ) -> u32;
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceAddFunction(
        Cxt: *mut WasmEdge_ModuleInstanceContext,
        Name: WasmEdge_String,
        FuncCxt: *mut WasmEdge_FunctionInstanceContext,
    );
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceAddTable(
        Cxt: *mut WasmEdge_ModuleInstanceContext,
        Name: WasmEdge_String,
        TableCxt: *mut WasmEdge_TableInstanceContext,
    );
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceAddMemory(
        Cxt: *mut WasmEdge_ModuleInstanceContext,
        Name: WasmEdge_String,
        MemoryCxt: *mut WasmEdge_MemoryInstanceContext,
    );
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceAddGlobal(
        Cxt: *mut WasmEdge_ModuleInstanceContext,
        Name: WasmEdge_String,
        GlobalCxt: *mut WasmEdge_GlobalInstanceContext,
    );
}
extern "C" {
    pub fn WasmEdge_ModuleInstanceDelete(Cxt: *mut WasmEdge_ModuleInstanceContext);
}
pub type WasmEdge_HostFunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        Data: *mut ::std::os::raw::c_void,
        CallFrameCxt: *const WasmEdge_CallingFrameContext,
        Params: *const WasmEdge_Value,
        Returns: *mut WasmEdge_Value,
    ) -> WasmEdge_Result,
>;
extern "C" {
    pub fn WasmEdge_FunctionInstanceCreate(
        Type: *const WasmEdge_FunctionTypeContext,
        HostFunc: WasmEdge_HostFunc_t,
        Data: *mut ::std::os::raw::c_void,
        Cost: u64,
    ) -> *mut WasmEdge_FunctionInstanceContext;
}
pub type WasmEdge_WrapFunc_t = ::std::option::Option<
    unsafe extern "C" fn(
        This: *mut ::std::os::raw::c_void,
        Data: *mut ::std::os::raw::c_void,
        CallFrameCxt: *const WasmEdge_CallingFrameContext,
        Params: *const WasmEdge_Value,
        ParamLen: u32,
        Returns: *mut WasmEdge_Value,
        ReturnLen: u32,
    ) -> WasmEdge_Result,
>;
extern "C" {
    pub fn WasmEdge_FunctionInstanceCreateBinding(
        Type: *const WasmEdge_FunctionTypeContext,
        WrapFunc: WasmEdge_WrapFunc_t,
        Binding: *mut ::std::os::raw::c_void,
        Data: *mut ::std::os::raw::c_void,
        Cost: u64,
    ) -> *mut WasmEdge_FunctionInstanceContext;
}
extern "C" {
    pub fn WasmEdge_FunctionInstanceGetData(
        Cxt: *const WasmEdge_FunctionInstanceContext,
    ) -> *const ::std::os::raw::c_void;
}
extern "C" {
    pub fn WasmEdge_FunctionInstanceGetFunctionType(
        Cxt: *const WasmEdge_FunctionInstanceContext,
    ) -> *const WasmEdge_FunctionTypeContext;
}
extern "C" {
    pub fn WasmEdge_FunctionInstanceDelete(Cxt: *mut WasmEdge_FunctionInstanceContext);
}
extern "C" {
    pub fn WasmEdge_TableInstanceCreate(
        TabType: *const WasmEdge_TableTypeContext,
    ) -> *mut WasmEdge_TableInstanceContext;
}
extern "C" {
    pub fn WasmEdge_TableInstanceCreateWithInit(
        TabType: *const WasmEdge_TableTypeContext,
        Value: WasmEdge_Value,
    ) -> *mut WasmEdge_TableInstanceContext;
}
extern "C" {
    pub fn WasmEdge_TableInstanceGetTableType(
        Cxt: *const WasmEdge_TableInstanceContext,
    ) -> *const WasmEdge_TableTypeContext;
}
extern "C" {
    pub fn WasmEdge_TableInstanceGetData(
        Cxt: *const WasmEdge_TableInstanceContext,
        Data: *mut WasmEdge_Value,
        Offset: u32,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_TableInstanceSetData(
        Cxt: *mut WasmEdge_TableInstanceContext,
        Data: WasmEdge_Value,
        Offset: u32,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_TableInstanceGetSize(Cxt: *const WasmEdge_TableInstanceContext) -> u32;
}
extern "C" {
    pub fn WasmEdge_TableInstanceGrow(
        Cxt: *mut WasmEdge_TableInstanceContext,
        Size: u32,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_TableInstanceDelete(Cxt: *mut WasmEdge_TableInstanceContext);
}
extern "C" {
    pub fn WasmEdge_MemoryInstanceCreate(
        MemType: *const WasmEdge_MemoryTypeContext,
    ) -> *mut WasmEdge_MemoryInstanceContext;
}
extern "C" {
    pub fn WasmEdge_MemoryInstanceGetMemoryType(
        Cxt: *const WasmEdge_MemoryInstanceContext,
    ) -> *const WasmEdge_MemoryTypeContext;
}
extern "C" {
    pub fn WasmEdge_MemoryInstanceGetData(
        Cxt: *const WasmEdge_MemoryInstanceContext,
        Data: *mut u8,
        Offset: u32,
        Length: u32,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_MemoryInstanceSetData(
        Cxt: *mut WasmEdge_MemoryInstanceContext,
        Data: *const u8,
        Offset: u32,
        Length: u32,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_MemoryInstanceGetPointer(
        Cxt: *mut WasmEdge_MemoryInstanceContext,
        Offset: u32,
        Length: u32,
    ) -> *mut u8;
}
extern "C" {
    pub fn WasmEdge_MemoryInstanceGetPointerConst(
        Cxt: *const WasmEdge_MemoryInstanceContext,
        Offset: u32,
        Length: u32,
    ) -> *const u8;
}
extern "C" {
    pub fn WasmEdge_MemoryInstanceGetPageSize(Cxt: *const WasmEdge_MemoryInstanceContext) -> u32;
}
extern "C" {
    pub fn WasmEdge_MemoryInstanceGrowPage(
        Cxt: *mut WasmEdge_MemoryInstanceContext,
        Page: u32,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_MemoryInstanceDelete(Cxt: *mut WasmEdge_MemoryInstanceContext);
}
extern "C" {
    pub fn WasmEdge_TagInstanceGetTagType(
        Cxt: *const WasmEdge_TagInstanceContext,
    ) -> *const WasmEdge_TagTypeContext;
}
extern "C" {
    pub fn WasmEdge_GlobalInstanceCreate(
        GlobType: *const WasmEdge_GlobalTypeContext,
        Value: WasmEdge_Value,
    ) -> *mut WasmEdge_GlobalInstanceContext;
}
extern "C" {
    pub fn WasmEdge_GlobalInstanceGetGlobalType(
        Cxt: *const WasmEdge_GlobalInstanceContext,
    ) -> *const WasmEdge_GlobalTypeContext;
}
extern "C" {
    pub fn WasmEdge_GlobalInstanceGetValue(
        Cxt: *const WasmEdge_GlobalInstanceContext,
    ) -> WasmEdge_Value;
}
extern "C" {
    pub fn WasmEdge_GlobalInstanceSetValue(
        Cxt: *mut WasmEdge_GlobalInstanceContext,
        Value: WasmEdge_Value,
    ) -> WasmEdge_Result;
}
extern "C" {
    pub fn WasmEdge_GlobalInstanceDelete(Cxt: *mut WasmEdge_GlobalInstanceContext);
}
pub const WasmEdge_ProgramOptionType_None: WasmEdge_ProgramOptionType = 0;
pub const WasmEdge_ProgramOptionType_Toggle: WasmEdge_ProgramOptionType = 1;
pub const WasmEdge_ProgramOptionType_Int8: WasmEdge_ProgramOptionType = 2;
pub const WasmEdge_ProgramOptionType_Int16: WasmEdge_ProgramOptionType = 3;
pub const WasmEdge_ProgramOptionType_Int32: WasmEdge_ProgramOptionType = 4;
pub const WasmEdge_ProgramOptionType_Int64: WasmEdge_ProgramOptionType = 5;
pub const WasmEdge_ProgramOptionType_UInt8: WasmEdge_ProgramOptionType = 6;
pub const WasmEdge_ProgramOptionType_UInt16: WasmEdge_ProgramOptionType = 7;
pub const WasmEdge_ProgramOptionType_UInt32: WasmEdge_ProgramOptionType = 8;
pub const WasmEdge_ProgramOptionType_UInt64: WasmEdge_ProgramOptionType = 9;
pub const WasmEdge_ProgramOptionType_Float: WasmEdge_ProgramOptionType = 10;
pub const WasmEdge_ProgramOptionType_Double: WasmEdge_ProgramOptionType = 11;
pub const WasmEdge_ProgramOptionType_String: WasmEdge_ProgramOptionType = 12;
pub type WasmEdge_ProgramOptionType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ProgramOption {
    pub Name: *const ::std::os::raw::c_char,
    pub Description: *const ::std::os::raw::c_char,
    pub Type: WasmEdge_ProgramOptionType,
    pub Storage: *mut ::std::os::raw::c_void,
    pub DefaultValue: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_WasmEdge_ProgramOption() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_ProgramOption> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_ProgramOption>(),
        40usize,
        concat!("Size of: ", stringify!(WasmEdge_ProgramOption))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_ProgramOption>(),
        8usize,
        concat!("Alignment of ", stringify!(WasmEdge_ProgramOption))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_ProgramOption),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Description) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_ProgramOption),
            "::",
            stringify!(Description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Type) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_ProgramOption),
            "::",
            stringify!(Type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Storage) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_ProgramOption),
            "::",
            stringify!(Storage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).DefaultValue) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_ProgramOption),
            "::",
            stringify!(DefaultValue)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_ModuleDescriptor {
    pub Name: *const ::std::os::raw::c_char,
    pub Description: *const ::std::os::raw::c_char,
    pub Create: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const WasmEdge_ModuleDescriptor,
        ) -> *mut WasmEdge_ModuleInstanceContext,
    >,
}
#[test]
fn bindgen_test_layout_WasmEdge_ModuleDescriptor() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_ModuleDescriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_ModuleDescriptor>(),
        24usize,
        concat!("Size of: ", stringify!(WasmEdge_ModuleDescriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_ModuleDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WasmEdge_ModuleDescriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_ModuleDescriptor),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Description) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_ModuleDescriptor),
            "::",
            stringify!(Description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Create) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_ModuleDescriptor),
            "::",
            stringify!(Create)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_PluginVersionData {
    pub Major: u32,
    pub Minor: u32,
    pub Patch: u32,
    pub Build: u32,
}
#[test]
fn bindgen_test_layout_WasmEdge_PluginVersionData() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_PluginVersionData> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_PluginVersionData>(),
        16usize,
        concat!("Size of: ", stringify!(WasmEdge_PluginVersionData))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_PluginVersionData>(),
        4usize,
        concat!("Alignment of ", stringify!(WasmEdge_PluginVersionData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Major) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginVersionData),
            "::",
            stringify!(Major)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Minor) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginVersionData),
            "::",
            stringify!(Minor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Patch) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginVersionData),
            "::",
            stringify!(Patch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Build) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginVersionData),
            "::",
            stringify!(Build)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WasmEdge_PluginDescriptor {
    pub Name: *const ::std::os::raw::c_char,
    pub Description: *const ::std::os::raw::c_char,
    pub APIVersion: u32,
    pub Version: WasmEdge_PluginVersionData,
    pub ModuleCount: u32,
    pub ProgramOptionCount: u32,
    pub ModuleDescriptions: *mut WasmEdge_ModuleDescriptor,
    pub ProgramOptions: *mut WasmEdge_ProgramOption,
}
#[test]
fn bindgen_test_layout_WasmEdge_PluginDescriptor() {
    const UNINIT: ::std::mem::MaybeUninit<WasmEdge_PluginDescriptor> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<WasmEdge_PluginDescriptor>(),
        64usize,
        concat!("Size of: ", stringify!(WasmEdge_PluginDescriptor))
    );
    assert_eq!(
        ::std::mem::align_of::<WasmEdge_PluginDescriptor>(),
        8usize,
        concat!("Alignment of ", stringify!(WasmEdge_PluginDescriptor))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginDescriptor),
            "::",
            stringify!(Name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Description) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginDescriptor),
            "::",
            stringify!(Description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).APIVersion) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginDescriptor),
            "::",
            stringify!(APIVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).Version) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginDescriptor),
            "::",
            stringify!(Version)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ModuleCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginDescriptor),
            "::",
            stringify!(ModuleCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProgramOptionCount) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginDescriptor),
            "::",
            stringify!(ProgramOptionCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ModuleDescriptions) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginDescriptor),
            "::",
            stringify!(ModuleDescriptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ProgramOptions) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(WasmEdge_PluginDescriptor),
            "::",
            stringify!(ProgramOptions)
        )
    );
}
extern "C" {
    pub fn WasmEdge_PluginLoadWithDefaultPaths();
}
extern "C" {
    pub fn WasmEdge_PluginLoadFromPath(Path: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn WasmEdge_PluginListPluginsLength() -> u32;
}
extern "C" {
    pub fn WasmEdge_PluginListPlugins(Names: *mut WasmEdge_String, Len: u32) -> u32;
}
extern "C" {
    pub fn WasmEdge_PluginFind(Name: WasmEdge_String) -> *const WasmEdge_PluginContext;
}
extern "C" {
    pub fn WasmEdge_PluginGetPluginName(Cxt: *const WasmEdge_PluginContext) -> WasmEdge_String;
}
extern "C" {
    pub fn WasmEdge_PluginListModuleLength(Cxt: *const WasmEdge_PluginContext) -> u32;
}
extern "C" {
    pub fn WasmEdge_PluginListModule(
        Cxt: *const WasmEdge_PluginContext,
        Names: *mut WasmEdge_String,
        Len: u32,
    ) -> u32;
}
extern "C" {
